{
  "title": "Revert Community Pool Tax Rate to 2%",
  "description": "### Summary\n\nThis `param-change` proposal aims to revert the Cosmos Hub’s `community_tax` parameter from 10% back to 2%, reinstating the baseline rate that was in effect prior to [**Proposal 88**](https://www.mintscan.io/cosmos/proposals/88/).\n\n---\n\n### Parameter Change\n\nThis is a proposed parameter change managed by the `x/distribution` module in the Cosmos SDK.\n\n**Parameter**: `community_tax`\n\n`community_tax` defines the portion of block rewards (newly minted ATOM) that are diverted into the Community Pool before the rest is distributed to stakers and validators. This parameter is modifiable through an on-chain `param-change` proposal.\n\n**Proposed Value**:\n\n| Module         | Parameter      | Current Value | Proposed Value |\n|----------------|----------------|---------------|----------------|\n| x/distribution | community_tax  | 0.10 (10%)    | 0.02 (2%)      |\n\nIf set to 0.02 → 2% of minted rewards go to the Community Pool.\n\n---\n\n### Background\n\n[**Proposal 88**](https://www.mintscan.io/cosmos/proposals/88/) raised the community tax from 2% to 10% to enable long-term funding of the **Atom Accelerator DAO (AADAO)** and similar initiatives. This tax increase facilitated allocations of 588,000 ATOM via [**Proposal 95**](https://www.mintscan.io/cosmos/proposals/95/), and an additional 975,811 ATOM (plus a 100,000 ATOM bonus) via [**Proposal 865**](https://www.mintscan.io/cosmos/proposals/865/).\n\nAs of Q1 2025, AADAO has entered maintenance mode and has declined to renew or revise its mandate. In view of these circumstances, the justification for maintaining a 10% tax no longer applies.\n\n---\n\n### Rationale for Reversion to 2%\n\n1. **Original Purpose of Tax Rate Increase No Longer Applies**\n\n2. **Avoid Capital Oversupply and Misallocation**\n\n3. **Decouple Tax Policy from Broader Governance Discussions**\n\n4. **Preserve Hub Autonomy with Fiscal Discipline**\n\n5. **Give More to Stakers**\n\nAssuming ~9.6 ATOM minted per block and ~4.36 million blocks/year:\n\n- Reducing the tax from 10% to 2% returns **0.768 ATOM per block** to stakers.\n- This results in approximately **3.34 million additional ATOM/year** in staking rewards.\n\n---\n\n### Clarification on Scope\n\nThis proposal **does not eliminate or reduce** existing Community Pool funds, which currently total approximately 9.29 million ATOM. Decisions concerning the active balance, usage, governance structure, or potential reforms of the Community Pool should be addressed through distinct governance proposals.\n\n---\n\n### Conclusion\n\nReducing the community tax rate to 2% is a prudent adjustment in the absence of an active, Cosmos Hub governance-approved funding mandate. This parameter change helps mitigate inadvertent capital accumulation, improves validator and staker economics, and reinforces fiscal discipline without compromising the Hub’s ability to fund public goods and services independently.\n\nIt also establishes a more appropriate baseline for future governance discussions concerning long-term treasury management frameworks and strategic capital deployment from the Community Pool.\n\n---\n\n### Links\n\n[**Cosmos Hub Forum Discussions**](https://forum.cosmos.network/t/proposal-draft-reverse-proposal-88-revert-community-pool-tax-rate-to-2/15397)\n\n---\n\n### Voting Options\n\n- **YES** – I support reducing the Community Pool tax rate from 10% to 2%.\n- **NO** – I support retaining the current Community Pool 10% tax rate.\n- **ABSTAIN** – I have a conflict of interest; or wish to participate without expressing a preference.\n- **NO WITH VETO** – I believe this proposal is (1) irrelevant to the Cosmos Hub, (2) maliciously and or unjustly harms minority interests, or (3) violates Cosmos Hub governance rules and or norms.",
  "changes": [
    {
      "subspace": "distribution",
      "key": "communitytax",
      "value": "0.02"
    }
  ],
  "deposit": "500000000uatom"
}
